 /**
  ******************************************************************************
  * 文件名程: bsp_iwdg.c 
  * 作    者: 硬石嵌入式开发团队
  * 版    本: V1.0
  * 编写日期: 2015-10-04
  * 功    能: 独立看门狗底层驱动程序
  ******************************************************************************
  * 说明：
  * 本例程配套硬石stm32开发板YS-F1Pro使用。
  * 
  * 淘宝：
  * 论坛：http://www.ing10bbs.com
  * 版权归硬石嵌入式开发团队所有，请勿商用。
  ******************************************************************************
  */
/* 包含头文件 ----------------------------------------------------------------*/
#include "bsp_iwdg.h"

/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/
/**
  * 函数功能: 板载蜂鸣器IO引脚初始化.
  * 输入参数: Tout = prv/40 * rlv (s) prv可以是[4,8,16,32,64,128,256]
  *            prv:预分频器值，取值如下：
  *            参数 IWDG_Prescaler_4: IWDG prescaler set to 4
  *            参数 IWDG_Prescaler_8: IWDG prescaler set to 8
  *            参数 IWDG_Prescaler_16: IWDG prescaler set to 16
  *            参数 IWDG_Prescaler_32: IWDG prescaler set to 32
  *            参数 IWDG_Prescaler_64: IWDG prescaler set to 64
  *            参数 IWDG_Prescaler_128: IWDG prescaler set to 128
  *            参数 IWDG_Prescaler_256: IWDG prescaler set to 256
  *
  *            rlv:预分频器值，取值范围为：0-0XFFF
  * 返 回 值: 无
  * 说    明：函数调用举例：
  *           IWDG_Config(IWDG_Prescaler_64 ,625);  // IWDG 1s 超时溢出
  */
void IWDG_Config(uint8_t prv ,uint16_t rlv)
{	
	/* 使能 预分频寄存器PR和重装载寄存器RLR可写 */
	IWDG_WriteAccessCmd( IWDG_WriteAccess_Enable );
	
	/* 设置预分频器值 */
	IWDG_SetPrescaler( prv );
	
	/* 设置重装载寄存器值 */
	IWDG_SetReload( rlv );
	
	/* 把重装载寄存器的值放到计数器中 */
	IWDG_ReloadCounter();
	
	/* 使能 IWDG */
	IWDG_Enable();	
}

/**
  * 函数功能: 喂狗
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明：无
  */
void IWDG_Feed(void)
{
	/* 把重装载寄存器的值放到计数器中，喂狗，防止IWDG复位
	   当计数器的值减到0的时候会产生系统复位 */
	IWDG_ReloadCounter();
}
/******************* (C) COPYRIGHT 2015-2020 硬石嵌入式开发团队 *****END OF FILE****/
